{
  "app-settings": [
    {
      "title": "Blog Arena",
      "id": "9f3e"
    },
    {
      "app-name": "Real Blogger",
      "id": "7909"
    },
    {
      "isActive": true,
      "id": "eb1e"
    }
  ],
  "posts": [
    {
      "id": "8",
      "title": "Tips for Effective Collaboration in Remote Teams",
      "datetime": "2025-01-09T13:00:00Z",
      "body": "In remote work, communication is key. Use the right tools and maintain a consistent schedule to stay on track and keep productivity high."
    },
    {
      "id": "10",
      "title": "Exploring RESTful APIs for Beginners",
      "datetime": "2025-01-07T15:00:00Z",
      "body": "RESTful APIs make communication between systems seamless. Understanding their architecture can significantly improve how you build web services."
    },
    {
      "id": "11",
      "title": "Mastering Version Control with Git",
      "datetime": "2025-01-06T14:15:00Z",
      "body": "Git allows developers to manage code changes effectively. Learn branching and merging for smoother team collaborations and code management."
    },
    {
      "id": "12",
      "title": "Top JavaScript Frameworks to Learn in 2025",
      "datetime": "2025-01-05T09:30:00Z",
      "body": "2025 is the year to master modern JavaScript frameworks like React, Vue, and Svelte. Choose one that fits your project needs and boost your productivity."
    },
    {
      "id": "13",
      "title": "The Future of Front-End Development",
      "datetime": "2025-01-04T13:00:00Z",
      "body": "As web technologies evolve, front-end development is becoming more powerful with features like WebAssembly, server-side rendering, and better build tools."
    },
    {
      "id": "14",
      "title": "Building Scalable Applications with Microservices",
      "datetime": "2025-01-03T12:45:00Z",
      "body": "Microservices help break down complex applications into smaller, manageable pieces. Learn how to scale your app while maintaining flexibility and performance."
    },
    {
      "id": "15",
      "title": "How to Optimize Your Web App for Speed",
      "datetime": "2025-01-02T10:00:00Z",
      "body": "Website speed matters. Implement lazy loading, optimize images, and reduce JavaScript to keep your web app running smoothly for users."
    },
    {
      "id": "16",
      "title": "JS: Understanding the Basics of Cloud Computing",
      "body": "JavaScript: Cloud computing offers scalable and cost-effective infrastructure. Learn the basics to deploy and manage applications on platforms like AWS and Azure.",
      "datetime": "2025-01-20T22:14:08.422Z"
    },
    {
      "id": "17",
      "title": "Python for mobile app development",
      "body": "Python for mobile app development",
      "datetime": "2025-01-20T22:40:47.813Z"
    }
  ]
}